TextSentimentModel(
  (embedding): Linear(in_features=1000, out_features=256, bias=True)
  (lstm): LSTM(256, 256, num_layers=4, batch_first=True, dropout=0.3)
  (fc): Sequential(
    (0): Linear(in_features=256, out_features=128, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.3, inplace=False)
    (3): Linear(in_features=128, out_features=2, bias=True)
  )
)